[
    {
      "term": "Balancing Relationship",
      "teacher_definition": "A causal relationship where change in one variable counteracts change in another, creating stability or resistance. In systems thinking, these relationships help maintain equilibrium.",
      "teaching_notes": "When explaining to students, use physical analogies like a thermostat: as the room gets colder, the heater works harder, bringing the temperature back to the desired level. In plastic waste contexts, point out how increased waste collection efforts may lead to decreased community concern, potentially undermining long-term action.",
      "modules": ["Module 3"]
    },
    {
      "term": "Causal Loop",
      "teacher_definition": "A visualization tool showing how variables in a system influence each other, with arrows indicating causal relationships. These loops help identify reinforcing (escalating) and balancing (stabilizing) processes within systems.",
      "teaching_notes": "Start with simple, familiar loops before applying to plastic waste. For example, the relationship between studying, test scores, and confidence: more studying leads to better scores, which builds confidence, which may encourage more studying (reinforcing loop).",
      "modules": ["Module 3"]
    },
    {
      "term": "Circular Economy",
      "teacher_definition": "An economic system aimed at eliminating waste by keeping materials in use through reuse, repair, refurbishment, and recycling, in contrast to the 'take-make-dispose' linear model. It seeks to regenerate natural systems and design out waste and pollution.",
      "teaching_notes": "Emphasize traditional circular practices in African contexts before introducing modern terminology. Use the banana plant example in Uganda or indigenous waste management in South Africa to show that circular thinking has deep cultural roots before being formalized as an economic concept.",
      "modules": ["Module 2", "Module 5"]
    },
    {
      "term": "Design Thinking",
      "teacher_definition": "A human-centered approach to problem-solving that includes empathizing with users, defining problems, ideating solutions, prototyping, and testing. It emphasizes understanding the needs of those affected by a problem before developing solutions.",
      "teaching_notes": "Stress that design thinking is not just for designers or artists. Use analogies to everyday problem-solving that students may already practice. Pair with local examples of intuitive design solutions that emerged from deep understanding of community needs.",
      "modules": ["Module 5"]
    },
    {
      "term": "Events",
      "teacher_definition": "The visible occurrences or incidents that can be readily observed (top level of Iceberg Model). Events are what first catch our attention but represent only the symptoms of deeper system structures.",
      "teaching_notes": "Use local examples of plastic pollution events that students can directly observe, such as clogged drainage channels in Kampala or plastic bottles on Cape Town beaches. Help students distinguish between the event itself and their emotional reaction to it.",
      "modules": ["Module 3"]
    },
    {
      "term": "Iceberg Model",
      "teacher_definition": "A systems thinking tool that distinguishes between visible events and the underlying patterns, structures, and mental models that cause them. It helps move analysis from reactive responses to events toward transformative change at deeper levels.",
      "teaching_notes": "Use a physical demonstration: hold up an actual object (like a plastic bottle) and progressively reveal deeper questions. Consider using a drawing of an iceberg with local examples at each level. For younger students, simplify to 'What we see/What we don't see' before introducing all four levels.",
      "modules": ["Module 3"]
    },
    {
      "term": "Linear Economy",
      "teacher_definition": "The traditional economic model where resources are extracted, used to make products, and disposed of as waste ('take-make-waste'). This model assumes infinite resources and unlimited capacity for waste absorption.",
      "teaching_notes": "Have students physically demonstrate this through a line formation, passing an object from extraction through production, use, and disposal. Contrast this with traditional non-linear practices in their communities to highlight that 'linear' is not 'natural' but a relatively recent economic development.",
      "modules": ["Module 2"]
    },
    {
      "term": "Mental Models",
      "teacher_definition": "The deeply held beliefs, assumptions, and values that shape how we see the world (deepest level of Iceberg Model). These often unconscious worldviews create and maintain the structures that generate patterns and events.",
      "teaching_notes": "This is the most abstract level for students to grasp. Use relatable examples like 'convenience is more important than durability' or 'individually wrapped items are more hygienic.' Ask students to identify where these beliefs came from and how they might be challenged.",
      "modules": ["Module 3", "Module 4"]
    },
    {
      "term": "Metanoia",
      "teacher_definition": "From ancient Greek, meaning 'a transformative change of heart or mind' - the profound shift in thinking that this curriculum aims to inspire. It involves not just gaining new information but experiencing a fundamental change in perspective.",
      "teaching_notes": "Share the etymology with students and link to examples of perspective shifts in other contexts they might be familiar with. Consider asking students to reflect on times when they've had a 'metanoia' moment about something in their lives.",
      "modules": ["Module 1"]
    },
    {
      "term": "Patterns",
      "teacher_definition": "Trends or recurring events that emerge over time (second level of Iceberg Model). Patterns reveal the history and trajectory of events, helping identify what behaviors or situations are getting better or worse.",
      "teaching_notes": "Ask students to look for patterns in data or observations collected over time. Good examples include seasonal flooding patterns related to plastic waste or increasing use of single-use packaging over the past decade. Use visual representations like graphs or timelines.",
      "modules": ["Module 3"]
    },
    {
      "term": "Reinforcing Relationship",
      "teacher_definition": "A causal relationship where change in one variable amplifies change in another, creating escalation or growth. These relationships can drive both positive improvements and negative decline.",
      "teaching_notes": "Use accessible examples of both virtuous and vicious cycles. A virtuous example: more community clean-ups lead to greater pride in environment, which motivates more clean-ups. A vicious example: more plastic litter leads to normalized littering behavior, which leads to more plastic litter.",
      "modules": ["Module 3"]
    },
    {
      "term": "SMART Criteria",
      "teacher_definition": "Framework for setting effective goals that are Specific, Measurable, Achievable, Relevant, and Time-bound. This approach increases the likelihood of successful implementation through clear, realistic goal-setting.",
      "teaching_notes": "Contrast vague goals ('reduce plastic use') with SMART goals ('bring reusable bags for all shopping trips this month'). Have students practice converting general intentions into SMART actions, particularly for personal commitments at the end of the curriculum.",
      "modules": ["Module 8"]
    },
    {
      "term": "Stakeholder",
      "teacher_definition": "Any individual, group, or organization that affects or is affected by a particular issue or initiative. Stakeholders have varying levels of interest, influence, and impact related to an issue.",
      "teaching_notes": "Help students identify both obvious and less obvious stakeholders in plastic waste issues. Emphasize that effective solutions require understanding diverse stakeholders' perspectives, even those they might initially disagree with. Use stakeholder mapping activities to visualize these relationships.",
      "modules": ["Module 6"]
    },
    {
      "term": "Structures",
      "teacher_definition": "The physical infrastructures, policies, or systems that create patterns (third level of Iceberg Model). These include formal elements like laws and infrastructure as well as informal elements like routines and relationships.",
      "teaching_notes": "Use tangible local examples like waste collection systems, packaging regulations, or market structures that influence plastic use. Help students distinguish between physical structures (like waste bins) and invisible structures (like pricing systems that make single-use items cheaper).",
      "modules": ["Module 3"]
    },
    {
      "term": "Systems Thinking",
      "teacher_definition": "An approach to understanding how different elements within a complex system interact and influence each other. It focuses on relationships and patterns rather than isolated parts, emphasizing how behavior emerges from system structure.",
      "teaching_notes": "Use physical demonstrations where possible, such as string connecting different elements to show relationships. Contrast 'linear thinking' (A causes B) with systems thinking (A influences B which influences C which influences A again). Apply to local plastic waste challenges by mapping interconnections.",
      "modules": ["Module 3", "Module 6"]
    },
    {
      "term": "Ubuntu",
      "teacher_definition": "South African concept meaning 'I am because we are,' emphasizing our interconnectedness and collective wellbeing. When applied to environmental leadership, it highlights how individual and community flourishing are intertwined.",
      "teaching_notes": "For South African contexts, explore this concept in depth. For Ugandan contexts, connect to similar local concepts of collective responsibility and community wellbeing. Use this concept to frame environmental action as community care rather than individual sacrifice.",
      "modules": ["Module 6", "Module 8"]
    },
    {
      "term": "Upcycling",
      "teacher_definition": "The process of transforming waste materials into new products of higher quality or environmental value. Unlike recycling which often reduces material quality, upcycling maintains or enhances value.",
      "teaching_notes": "Distinguish clearly between downcycling (most recycling), recycling, and upcycling. Showcase local examples of upcycled products, particularly those creating economic opportunities. Consider inviting local artisans who upcycle plastic waste to demonstrate techniques.",
      "modules": ["Module 2", "Module 5"]
    }
  ]